{
  "id": "mail-server",
  "title": "Professional Mail Server",
  "description": "Enterprise-grade self-hosted email with Mailcow. Full Docker setup with SSL, spam protection, DNS, and webmail for a secure, private, production-ready system.",
  "detailedDescription": "Take full control of your email infrastructure with a professionally deployed Mailcow mail server. I specialize in building secure, containerized email systems that give you complete ownership and privacy. This comprehensive service includes: Docker-based Mailcow installation, automatic SSL/TLS certificates via Let's Encrypt, complete DNS configuration (DKIM, SPF, DMARC for maximum deliverability), Rspamd spam filtering with ClamAV antivirus protection, modern Roundcube webmail interface, and security hardening. Perfect for businesses, startups, agencies, and IT professionals who demand data privacy, reliable performance, and independence from third-party email providers. Your mail server will be fully operational, optimized for deliverability, and configured according to industry best practices. With years of experience in mail server administration and Docker containerization, I ensure your email system runs smoothly from day one.",
  "category": "infrastructure",
  "icon": "fa-solid fa-envelope-open-text",
  "tone": "blue",
  "startingPrice": 120,
  "deliveryDays": 3,
  "packages": [
    {
      "name": "Basic Setup",
      "price": "$120",
      "features": [
        "Complete Mailcow Docker stack installation on your server",
        "Single domain configuration with DKIM, SPF, and DMARC records",
        "Automated SSL/TLS certificates (Let's Encrypt) with auto-renewal",
        "Admin panel setup with up to 10 user mailboxes",
        "Rspamd spam filtering and ClamAV antivirus protection",
        "Roundcube webmail interface configuration",
        "Basic firewall rules (UFW/iptables) and security hardening",
        "Mobile device sync support (IMAP/SMTP)",
        "Email aliases and forwarding setup",
        "Configuration documentation provided"
      ],
      "deliveryTime": "2-3 days"
    },
    {
      "name": "Advanced Setup",
      "price": "$210",
      "features": [
        "Full Mailcow deployment with optimized Docker configuration",
        "Multi-domain support (up to 5 domains) with complete DNS setup",
        "Advanced spam protection with custom Rspamd rules and greylisting",
        "Branded Roundcube webmail with your company logo and colors",
        "Automated daily backups (local storage with 14-day retention)",
        "Docker container monitoring with Watchtower for automatic updates",
        "Fail2ban integration for brute-force protection",
        "Email authentication testing and deliverability optimization",
        "Catch-all addresses and distribution lists",
        "IMAP/SMTP quota management per user",
        "Email filtering rules and autoresponders",
        "Comprehensive admin documentation and 1-hour training session",
        "Post-delivery configuration review and optimization"
      ],
      "deliveryTime": "4-5 days"
    },
    {
      "name": "Enterprise Solution",
      "price": "$360",
      "features": [
        "High-availability Mailcow setup with container redundancy planning",
        "Unlimited domain support with automated DNS propagation checks",
        "Enterprise-grade security: hardened firewall, fail2ban, and intrusion detection",
        "Real-time monitoring dashboard with Grafana & email/SMS alerting system",
        "Encrypted automated backups to remote location or AWS S3/compatible storage",
        "Complete mailbox migration from Gmail, Office 365, cPanel, Plesk, or IMAP",
        "SOGo groupware integration for calendar and contacts sync (CalDAV/CardDAV)",
        "Custom rate limiting and queue management for bulk sending",
        "Advanced logging with ELK stack for compliance requirements",
        "Email archiving solution for regulatory compliance",
        "Two-factor authentication (2FA) for admin and users",
        "Custom SPF/DKIM rotation for enhanced deliverability",
        "Priority support: 60 days of post-delivery technical assistance",
        "Quarterly maintenance checklist and security audit recommendations"
      ],
      "deliveryTime": "7-10 days"
    }
  ],
  "guarantees": [
    { "icon": "fas fa-shield-alt", "text": "Military-grade security hardening and encryption" },
    { "icon": "fas fa-envelope", "text": "99.9% email deliverability with proper DNS authentication" },
    { "icon": "fas fa-lock", "text": "Automatic SSL/TLS certificates with lifetime renewal" },
    { "icon": "fas fa-filter", "text": "Advanced spam and malware protection configured" },
    { "icon": "fas fa-database", "text": "Automated backup system included in all packages" },
    { "icon": "fas fa-user-shield", "text": "Full data privacy, your emails stay on your server" },
    { "icon": "fas fa-clock", "text": "Fast deployment with minimal downtime" },
    { "icon": "fas fa-life-ring", "text": "Post-delivery support and documentation" }
  ],
  "extras": [
    { "name": "Additional domain setup", "price": "$15", "description": "Configure one additional email domain with complete DKIM, SPF, DMARC records and SSL certificate" },
    { "name": "Custom webmail branding", "price": "$30", "description": "Professional Roundcube customization: company logo, color scheme, custom login page, and branded email templates" },
    { "name": "Email migration service", "price": "$50", "description": "Seamless mailbox migration from Gmail, Office 365, cPanel, Plesk, or any IMAP server. Preserves folder structure and email history" },
    { "name": "Uptime monitoring & alerting", "price": "$25", "description": "Configure UptimeRobot or custom monitoring with instant alerts via email/SMS for server downtime or service issues" },
    { "name": "Additional user mailboxes", "price": "$5/user", "description": "Create and configure extra mailboxes with proper quotas and access permissions (bulk pricing available)" },
    { "name": "Remote backup configuration", "price": "$35", "description": "Set up automated encrypted backups to AWS S3, Backblaze B2, or your preferred remote storage with 30-day retention" },
    { "name": "SOGo groupware integration", "price": "$45", "description": "Install and configure SOGo for calendar, contacts, and task synchronization (CalDAV/CardDAV support)" },
    { "name": "Priority email support (3 months)", "price": "$75", "description": "Extended technical support with priority response for troubleshooting, optimization, and configuration changes" },
    { "name": "Email archiving", "price": "$60", "description": "Automated email archiving system for compliance and legal requirements" },
    { "name": "Anti-spam training", "price": "$40", "description": "Custom Rspamd rule optimization and spam filter training for your environment" },
    { "name": "Mailing list setup", "price": "$40", "description": "Configure Mailman or similar for newsletter/announcement lists" },
    { "name": "LDAP/AD integration", "price": "$75", "description": "Integrate with existing LDAP or Active Directory for centralized authentication" }
  ],
  "meta": {
    "deliveryTime": "2-10 days",
    "revisions": "2 revisions included"
  }
}